zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/atdf/PIC32CK1012SG00048.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x4481C000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA00" ioset="1 2"/>
              <signal group="WO" index="1" function="G" pad="PD06" ioset="2"/>
              <signal group="WO" index="1" function="F" pad="PC11" ioset="2"/>
              <signal group="WO" index="2" function="G" pad="PD07" ioset="2"/>
              <signal group="WO" index="2" function="F" pad="PC10" ioset="2"/>
              <signal group="WO" index="3" function="F" pad="PA01" ioset="1 2"/>
              <signal group="WO" index="4" function="F" pad="PD06" ioset="1 2"/>
              <signal group="WO" index="5" function="F" pad="PD07" ioset="1 2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="6" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="28" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="29" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_MC_2" value="30" caption="Indexes of DMA Match/Compare triggers 2"/>
              <param name="DMAC_ID_MC_3" value="31" caption="Indexes of DMA Match/Compare triggers 3"/>
              <param name="DMAC_ID_MC_4" value="32" caption="Indexes of DMA Match/Compare triggers 4"/>
              <param name="DMAC_ID_MC_5" value="33" caption="Indexes of DMA Match/Compare triggers 5"/>
              <param name="DMAC_ID_OVF" value="27" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="24" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="46" caption="Instance index for TCC2"/>
              <param name="MCLK_ID_APB" value="77" caption="Index for TCC2 APB clock"/>
              <param name="PAC_ID" value="46" caption="Index for TCC2 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC3">
            <register-group name="TCC3" name-in-module="TCC" address-space="base" offset="0x4481E000"/>
            <signals>
              <signal group="WO" index="0" function="G" pad="PA09" ioset="2 3"/>
              <signal group="WO" index="1" function="G" pad="PA10" ioset="2 3"/>
              <signal group="WO" index="2" function="G" pad="PA11" ioset="2 3"/>
              <signal group="WO" index="2" function="F" pad="PA06" ioset="1"/>
              <signal group="WO" index="3" function="G" pad="PA12" ioset="2 3"/>
              <signal group="WO" index="3" function="F" pad="PA07" ioset="1"/>
              <signal group="WO" index="4" function="G" pad="PB00" ioset="2 3"/>
              <signal group="WO" index="5" function="G" pad="PB01" ioset="2 3"/>
              <signal group="WO" index="6" function="G" pad="PA06" ioset="3"/>
              <signal group="WO" index="7" function="G" pad="PA07" ioset="3"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="6" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="35" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="36" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_MC_2" value="37" caption="Indexes of DMA Match/Compare triggers 2"/>
              <param name="DMAC_ID_MC_3" value="38" caption="Indexes of DMA Match/Compare triggers 3"/>
              <param name="DMAC_ID_MC_4" value="39" caption="Indexes of DMA Match/Compare triggers 4"/>
              <param name="DMAC_ID_MC_5" value="40" caption="Indexes of DMA Match/Compare triggers 5"/>
              <param name="DMAC_ID_OVF" value="34" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="24" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="32"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="47" caption="Instance index for TCC3"/>
              <param name="MCLK_ID_APB" value="78" caption="Index for TCC3 APB clock"/>
              <param name="PAC_ID" value="47" caption="Index for TCC3 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC4">
            <register-group name="TCC4" name-in-module="TCC" address-space="base" offset="0x45008000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA11" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PA12" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="50" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="51" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="49" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="29" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="68" caption="Instance index for TCC4"/>
              <param name="MCLK_ID_APB" value="100" caption="Index for TCC4 APB clock"/>
              <param name="PAC_ID" value="68" caption="Index for TCC4 registers write protection"/>
            </parameters>
          </instance>
          <instance name="TCC5">
            <register-group name="TCC5" name-in-module="TCC" address-space="base" offset="0x4500A000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PB00" ioset="1"/>
              <signal group="WO" index="1" function="F" pad="PB01" ioset="1"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_MC_0" value="53" caption="Indexes of DMA Match/Compare triggers 0"/>
              <param name="DMAC_ID_MC_1" value="54" caption="Indexes of DMA Match/Compare triggers 1"/>
              <param name="DMAC_ID_OVF" value="52" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="GCLK_ID" value="30" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="69" caption="Instance index for TCC5"/>
              <param name="MCLK_ID_APB" value="101" caption="Index for TCC5 APB clock"/>
              <param name="PAC_ID" value="69" caption="Index for TCC5 registers write protection"/>
            </parameters>
          </instance>
        </module>
