zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg00/atdf/PIC32CK1012SG00048.atdf
      <value-group name="AUDCTRL__AUDFMT">
        <value name="I2SLEGACY" caption="Legacy I2S Mode" value="0x0"/>
        <value name="I2SRAW" caption="I2S Raw Audio Format" value="0x1"/>
        <value name="I2SOTHER824" caption="I2S Other AM824 Format" value="0x2"/>
        <value name="I8SOTHER" caption="I8S Other Format" value="0x4"/>
        <value name="I8SRAW" caption="I8S Raw Audio Format" value="0x5"/>
        <value name="I8SOTHER824" caption="I8S Other AM824 Format" value="0x6"/>
      </value-group>
      <value-group name="TPDCTRL__PKFMT">
        <value name="PKT4x32" caption="32 bit data in 4x32 packed format" value="0x0"/>
        <value name="PKT3x32" caption="32 bit data in 3x32 packed format" value="0x1"/>
        <value name="PKT4x24" caption="24 bit data in 4x24 packed format" value="0x2"/>
        <value name="PKT3x24" caption="24 bit data in 3x24 packed format" value="0x3"/>
        <value name="PKT6x16" caption="16 bit data in 6x16 packed format" value="0x4"/>
        <value name="PKT4x16" caption="16 bit data in 4x16 packed format" value="0x5"/>
        <value name="PKT2x16" caption="16 bit data in 2x16 packed format" value="0x6"/>
      </value-group>
      <value-group name="TPDCTRL__SLVNUM">
        <value name="SLAVE0" caption="SLAVE 0" value="0x0"/>
        <value name="SLAVE1" caption="SLAVE 1" value="0x1"/>
        <value name="SLAVE2" caption="SLAVE 2" value="0x2"/>
        <value name="SLAVE3" caption="SLAVE 3" value="0x3"/>
        <value name="SLAVE4" caption="SLAVE 4" value="0x4"/>
      </value-group>
    </module>
    <module name="SQI" id="04044" name2="sqi_ctlr_v4" version="4b0" caption="Polaris Serial Quad Interface SIB">
      <register-group name="SQI" caption="Polaris Serial Quad Interface SIB">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" atomic-op="set:CTRLA" initval="0x00000000" caption="Control A register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="CTRLA__SWRST"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40" values="CTRLA__RUNSTDBY"/>
        </register>
        <register name="INTENCLR" offset="0x10" rw="RW" size="4" atomic-op="clear:INTEN" initval="0x00000000" caption="Interrupt Enable Clear Register">
          <bitfield name="SQI" caption="SQI Interrupt Enable Clear" mask="0x1" values="INTENCLR__SQI"/>
        </register>
        <register name="INTENSET" offset="0x14" rw="RW" size="4" atomic-op="set:INTEN" initval="0x00000000" caption="Interrupt Enable Set Register">
          <bitfield name="SQI" caption="SQI Interrupt Enable Set" mask="0x1" values="INTENSET__SQI"/>
        </register>
        <register name="INTFLAG" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Status and Clear Register">
          <bitfield name="SQI" caption="Read value reflects the state of the interrupt flag. Do not use the interrupt flag and associated mask registers if the EIP already provides similar controls for its interrupts. This feature is design for interrupts created in the SIB or EIP which do not have mask or flag bits. Write to 1 to clear the flag." mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Syncbusy Register">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1" values="SYNCBUSY__SWRST"/>
        </register>
        <register name="XCON1" offset="0x100" rw="RW" size="4" initval="0x202C0C00" caption="SPI XIP Control1 register">
          <bitfield name="TYPECMD" caption="SPI TYPE Command  - Single lane mode, - Dual lane mode, - Quad lane mode, - Reserved for Future use, Based on this field, the boot controller will send the command in 1/2/4 lane." mask="0x3"/>
          <bitfield name="TYPEADDR" caption="SPI TYPE Address 00 - Single lane mode ,01 - Dual lane mode ,10 - Quad lane mode ,11 - Reserved for Future use  Based on this field, the boot controller will send  the Address in 1/2/4 lane." mask="0xC"/>
          <bitfield name="TYPEMODE" caption="SPI TYPE Mode: 00 - Single lane mode, 01 - Dual lane mode, 10 - Quad lane mode, 11 - Reserved for Future use. Based on this field, the boot controller will send the Mode in 1/2/4 lane." mask="0x30"/>
          <bitfield name="TYPEDUMMY" caption="SPI TYPE DUMMY: 00 - Single lane mode ,01 - Dual lane mode,10 - Quad lane mode ,11 - Reserved for Future use. Based on this field, the boot controller will send the Dummy in 1/2/4 lane." mask="0xC0"/>
          <bitfield name="TYPEDATA" caption="SPI TYPE DATA: 00 - Single lane mode  ,01 - Dual lane mode  ,10 - Quad lane mode  ,11 - Reserved for Future use  Based on this field, the boot controller will receive the data in 1/2/4 lane." mask="0x300"/>
          <bitfield name="READOPCODE" caption="8bit opcode value for Read operation" mask="0x3FC00"/>
          <bitfield name="ADDRBYTES" caption="000  - Zero Address Bytes ,001  - 1 Address Byte ,010  - 2 Address Bytes ,011  - 3 Address Bytes ,100  - 4 Address Bytes ,101  - 111- Reserved for Future Use" mask="0x1C0000"/>
          <bitfield name="DUMMYBYTES" caption="000  - Zero Dummy bytes ,001  - Transmit one dummy byte (8?h ff) ,010  - Transmit two dummy bytes (16?h ffff) ,011  - Transmit three dummy bytes (24?h ffffff) ,111  - Transmit Seven dummy bytes" mask="0xE00000"/>
          <bitfield name="DDRCMD" caption="XIP SPI TYPE CMD DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send  the command in SDR/DDR mode." mask="0x1000000"/>
          <bitfield name="DDRADDR" caption="XIP SPI TYPE ADDR DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send  the address bytes in SDR/DDR mode." mask="0x2000000"/>
          <bitfield name="DDRMODE" caption="XIP SPI TYPE MODE DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send the mode bytes in SDR/DDR mode." mask="0x4000000"/>
          <bitfield name="DDRDUMMY" caption="XIP SPI TYPE DUMMY DDR. 0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send the dummy bytes in SDR/DDR mode." mask="0x8000000"/>
          <bitfield name="DDRDATA" caption="XIP SPI TYPE DATA DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send  the data in SDR/DDR mode." mask="0x10000000"/>
          <bitfield name="SDRCMD" caption="SPI TYPE CMD SDR2DDR: This bit is used by the controller only when  XIP_SPI_TYPE_CMD_DDR is 1?b1 i.e., when command sent in DDR mode. 0 - The command (XIP_SPI_READ_OPCODE) will take 4 clock cycles. Data will go in both the edges. Used when Flash expecting the cmd in ddr mode. Here the command will go as 1byte only. 1- The command (XIP_SPI_READ_OPCODE) will take 8 clock cycles. Data will go in both the edges. Used when Flash expecting the cmd in sdr mode, but user wants to send in ddr mode. Here the command will go as 2bytes. The value (single byte) programmed in XIP_SPI_READ_OPCODE is replicated into 2bytes by the controller and sent on spi bus. Example for CMD SDR2DDR bit 1: Say opcode = 'h ac (1010 1100) Replicated pattern 11 00 11 00 11 11 00 00 ('h ccf0). So 1st 4 clock cycles hcc; next 4 clock cycles hf0 goes on spi bus." mask="0x20000000"/>
        </register>
